hotRoom6M_highZo/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1400;
        startFace       389050;
    }
    top
    {
        type            patch;
        inGroups        1(patch);
        nFaces          1400;
        startFace       390450;
    }
    inlet
    {
        type            patch;
        nFaces          1900;
        startFace       391850;
    }
    outlet
    {
        type            patch;
        nFaces          1900;
        startFace       393750;
    }
    side01
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          6650;
        startFace       395650;
    }
    side02
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          6650;
        startFace       402300;
    }
)

// ************************************************************************* //
