hotRoom6M_highZo/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.425;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
      type            calculated;
        value           uniform 0;
    }
    top
    {
      type            calculated;
        value           uniform 0.425;
    }
    bottom
    {
        type            atmNutWallFunction;
        #include        "ABLConditions";
        value           uniform 0.0001;
    }
    side01
    {
        type            symmetry;
    }

    side02
    {
        type            symmetry;
    }
}


// ************************************************************************* //
